//LCBMSC01 JOB (LCIQ),'LIFECORE BMS COMPILE',CLASS=A,
//            MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*--------------------------------------------------------------------*
//* LCBMSC01 - LIFECORE IQ - COMPILACAO DOS MAPAS BMS                  *
//*            Compila os mapsets BMS do modulo CICS                    *
//*--------------------------------------------------------------------*
//*
//* STEP1: Montar LCMAPA01 (Login)
//*
//ASMMAP01 EXEC PGM=ASMA90,
//            PARM='OBJECT,NODECK,NOLOAD'
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=CICSTS.V5R6M0.CICS.SDFHMAC,DISP=SHR
//SYSIN    DD DSN=HERC01.LIFECORE.BMS(LCMAPA01),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSGO    DD DSN=HERC01.LIFECORE.BMS.OBJ(LCMAPA01),
//            DISP=SHR
//*
//LNKMAP01 EXEC PGM=IEWL,COND=(0,NE,ASMMAP01),
//            PARM='REUS,MAP,LIST'
//SYSLIB   DD DSN=CICSTS.V5R6M0.CICS.SDFHLOAD,DISP=SHR
//SYSLMOD  DD DSN=HERC01.LIFECORE.BMS.LOAD(LCMAPA01),
//            DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DSN=HERC01.LIFECORE.BMS.OBJ(LCMAPA01),
//            DISP=SHR
//*
//* STEP2: Montar LCMAPA02 (Menu)
//*
//ASMMAP02 EXEC PGM=ASMA90,
//            PARM='OBJECT,NODECK,NOLOAD',
//            COND=(0,NE)
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=CICSTS.V5R6M0.CICS.SDFHMAC,DISP=SHR
//SYSIN    DD DSN=HERC01.LIFECORE.BMS(LCMAPA02),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSGO    DD DSN=HERC01.LIFECORE.BMS.OBJ(LCMAPA02),
//            DISP=SHR
//*
//LNKMAP02 EXEC PGM=IEWL,COND=(0,NE,ASMMAP02),
//            PARM='REUS,MAP,LIST'
//SYSLIB   DD DSN=CICSTS.V5R6M0.CICS.SDFHLOAD,DISP=SHR
//SYSLMOD  DD DSN=HERC01.LIFECORE.BMS.LOAD(LCMAPA02),
//            DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DSN=HERC01.LIFECORE.BMS.OBJ(LCMAPA02),
//            DISP=SHR
//*
//* STEP3: Montar LCMAPA03 (Apolices)
//*
//ASMMAP03 EXEC PGM=ASMA90,
//            PARM='OBJECT,NODECK,NOLOAD',
//            COND=(0,NE)
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=CICSTS.V5R6M0.CICS.SDFHMAC,DISP=SHR
//SYSIN    DD DSN=HERC01.LIFECORE.BMS(LCMAPA03),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSGO    DD DSN=HERC01.LIFECORE.BMS.OBJ(LCMAPA03),
//            DISP=SHR
//*
//LNKMAP03 EXEC PGM=IEWL,COND=(0,NE,ASMMAP03),
//            PARM='REUS,MAP,LIST'
//SYSLIB   DD DSN=CICSTS.V5R6M0.CICS.SDFHLOAD,DISP=SHR
//SYSLMOD  DD DSN=HERC01.LIFECORE.BMS.LOAD(LCMAPA03),
//            DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DSN=HERC01.LIFECORE.BMS.OBJ(LCMAPA03),
//            DISP=SHR
//*
//* STEP4: Montar LCMAPA04 (Cadastro de Estipulante)
//*
//ASMMAP04 EXEC PGM=ASMA90,
//            PARM='OBJECT,NODECK,NOLOAD',
//            COND=(0,NE)
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=CICSTS.V5R6M0.CICS.SDFHMAC,DISP=SHR
//SYSIN    DD DSN=HERC01.LIFECORE.BMS(LCMAPA04),DISP=SHR
//SYSPUNCH DD DSN=HERC01.LIFECORE.COPYLIB(LCMSET4),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSGO    DD DSN=HERC01.LIFECORE.BMS.OBJ(LCMAPA04),
//            DISP=SHR
//*
//LNKMAP04 EXEC PGM=IEWL,COND=(0,NE,ASMMAP04),
//            PARM='REUS,MAP,LIST'
//SYSLIB   DD DSN=CICSTS.V5R6M0.CICS.SDFHLOAD,DISP=SHR
//SYSLMOD  DD DSN=HERC01.LIFECORE.BMS.LOAD(LCMAPA04),
//            DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DSN=HERC01.LIFECORE.BMS.OBJ(LCMAPA04),
//            DISP=SHR
//*
//* STEP9: Montar LCMAPA09 (Consulta de importacoes iniciais)
//*
//ASMMAP09 EXEC PGM=ASMA90,
//            PARM='OBJECT,NODECK,NOLOAD',
//            COND=(0,NE)
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=CICSTS.V5R6M0.CICS.SDFHMAC,DISP=SHR
//SYSIN    DD DSN=HERC01.LIFECORE.BMS(LCMAPA09),DISP=SHR
//SYSPUNCH DD DSN=HERC01.LIFECORE.COPYLIB(LCMSET9),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSGO    DD DSN=HERC01.LIFECORE.BMS.OBJ(LCMAPA09),
//            DISP=SHR
//*
//LNKMAP09 EXEC PGM=IEWL,COND=(0,NE,ASMMAP09),
//            PARM='REUS,MAP,LIST'
//SYSLIB   DD DSN=CICSTS.V5R6M0.CICS.SDFHLOAD,DISP=SHR
//SYSLMOD  DD DSN=HERC01.LIFECORE.BMS.LOAD(LCMAPA09),
//            DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSLIN   DD DSN=HERC01.LIFECORE.BMS.OBJ(LCMAPA09),
//            DISP=SHR
//*------------------------------------------------------------------*
