 DEFINE GROUP(LIFECORE) DESCRIPTION(LifeCore IQ CICS Resources)
*--------------------------------------------------------------------*
* LIFECORE IQ - CICS CSD DEFINITIONS                                 *
* Aplica via: DFHCSDUP SCRIPT(HERC01.LIFECORE.CSD)                   *
*             ou CEDA INSTALL GROUP(LIFECORE)                         *
*--------------------------------------------------------------------*
*
* --- PROGRAMAS CICS -------------------------------------------------
*
 DEFINE PROGRAM(LCCICS01)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Login)
        LANGUAGE(COBOL)
        RELOAD(NO)
        RESIDENT(NO)
        USAGE(NORMAL)
        USELPACOPY(NO)
        STATUS(ENABLED)
        CEDF(YES)
        DATALOCATION(ANY)
        EXECKEY(USER)
        CONCURRENCY(QUASIRENT)
*
 DEFINE PROGRAM(LCCICS02)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Menu Principal)
        LANGUAGE(COBOL)
        RELOAD(NO)
        RESIDENT(NO)
        USAGE(NORMAL)
        STATUS(ENABLED)
        CEDF(YES)
        DATALOCATION(ANY)
        EXECKEY(USER)
        CONCURRENCY(QUASIRENT)
*
 DEFINE PROGRAM(LCCICS03)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Consulta de Apolices)
        LANGUAGE(COBOL)
        RELOAD(NO)
        RESIDENT(NO)
        USAGE(NORMAL)
        STATUS(ENABLED)
        CEDF(YES)
        DATALOCATION(ANY)
        EXECKEY(USER)
        CONCURRENCY(QUASIRENT)
*
 DEFINE PROGRAM(LCCICS04)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Cadastro de Estipulante DB2)
        LANGUAGE(COBOL)
        RELOAD(NO)
        RESIDENT(NO)
        USAGE(NORMAL)
        STATUS(ENABLED)
        CEDF(YES)
        DATALOCATION(ANY)
        EXECKEY(USER)
        CONCURRENCY(QUASIRENT)
*
 DEFINE PROGRAM(LCCICS09)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Consulta Lotes Importacao DB2)
        LANGUAGE(COBOL)
        RELOAD(NO)
        RESIDENT(NO)
        USAGE(NORMAL)
        STATUS(ENABLED)
        CEDF(YES)
        DATALOCATION(ANY)
        EXECKEY(USER)
        CONCURRENCY(QUASIRENT)
*
* --- MAPSETS BMS ----------------------------------------------------
*
 DEFINE MAPSET(LCMAPA01)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Mapa Login)
        RESIDENT(NO)
        STATUS(ENABLED)
        USELPACOPY(NO)
*
 DEFINE MAPSET(LCMAPA02)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Mapa Menu)
        RESIDENT(NO)
        STATUS(ENABLED)
        USELPACOPY(NO)
*
 DEFINE MAPSET(LCMAPA03)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Mapa Apolices)
        RESIDENT(NO)
        STATUS(ENABLED)
        USELPACOPY(NO)
*
 DEFINE MAPSET(LCMAPA04)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Mapa Cadastro de Estipulante)
        RESIDENT(NO)
        STATUS(ENABLED)
        USELPACOPY(NO)
*
 DEFINE MAPSET(LCMAPA09)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Consulta Lotes Importacao)
        RESIDENT(NO)
        STATUS(ENABLED)
        USELPACOPY(NO)
*
* --- TRANSACOES -----------------------------------------------------
*
 DEFINE TRANSACTION(LCIN)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Login)
        PROGRAM(LCCICS01)
        TWASIZE(0)
        PROFILE(DFHCICST)
        STATUS(ENABLED)
        TASKDATALOC(ANY)
        TASKDATAKEY(USER)
        STORAGECLEAR(NO)
        RUNAWAY(SYSTEM)
        SHUTDOWN(ENABLED)
        ISOLATE(YES)
        BREXIT(DFHDBORG)
*
 DEFINE TRANSACTION(LCMN)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Menu Principal)
        PROGRAM(LCCICS02)
        TWASIZE(0)
        PROFILE(DFHCICST)
        STATUS(ENABLED)
        TASKDATALOC(ANY)
        TASKDATAKEY(USER)
        STORAGECLEAR(NO)
        RUNAWAY(SYSTEM)
        SHUTDOWN(ENABLED)
        ISOLATE(YES)
        BREXIT(DFHDBORG)
*
 DEFINE TRANSACTION(LCAP)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Apolices)
        PROGRAM(LCCICS03)
        TWASIZE(0)
        PROFILE(DFHCICST)
        STATUS(ENABLED)
        TASKDATALOC(ANY)
        TASKDATAKEY(USER)
        STORAGECLEAR(NO)
        RUNAWAY(SYSTEM)
        SHUTDOWN(ENABLED)
        ISOLATE(YES)
        BREXIT(DFHDBORG)
*
 DEFINE TRANSACTION(LCES)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Cadastro de Estipulante)
        PROGRAM(LCCICS04)
        TWASIZE(0)
        PROFILE(DFHCICST)
        STATUS(ENABLED)
        TASKDATALOC(ANY)
        TASKDATAKEY(USER)
        STORAGECLEAR(NO)
        RUNAWAY(SYSTEM)
        SHUTDOWN(ENABLED)
        ISOLATE(YES)
        BREXIT(DFHDBORG)
*
 DEFINE TRANSACTION(LCIM)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - Consulta Lotes Importados)
        PROGRAM(LCCICS09)
        TWASIZE(0)
        PROFILE(DFHCICST)
        STATUS(ENABLED)
        TASKDATALOC(ANY)
        TASKDATAKEY(USER)
        STORAGECLEAR(NO)
        RUNAWAY(SYSTEM)
        SHUTDOWN(ENABLED)
        ISOLATE(YES)
        BREXIT(DFHDBORG)
*
* --- ARQUIVOS VSAM --------------------------------------------------
*
 DEFINE FILE(LCAPOLVC)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - VSAM KSDS Apolices)
        DSNAME(LIFECORE.VSAM.APOLICE)
        DISPOSITION(SHARE)
        DSNSHARING(ALLREQS)
        STRINGS(3)
        LSRPOOLID(1)
        READINTEG(UNCOMMITTED)
        DATABUFFERS(2)
        INDEXBUFFERS(1)
        TYPE(VSAM)
        RLSACCESS(NO)
        REMOTESYSTEM()
        REMOTENAME()
        KEYLENGTH(10)
        RECORDSIZE(200)
        ADD(NO)
        BROWSE(YES)
        DELETE(NO)
        READ(YES)
        UPDATE(NO)
        STATUS(ENABLED)
        OPENTIME(FIRSTREF)
        TABLE(NO)
        MAXNUMRECS(NOLIMIT)
        LOAD(NO)
        UPDATEMODEL(LOCKING)
        BLOCKKEYLEN(0)
        BLOCKSIZE(0)
*
 DEFINE FILE(LCCOBTVC)
        GROUP(LIFECORE)
        DESCRIPTION(LifeCore IQ - VSAM KSDS Coberturas/Segurados)
        DSNAME(LIFECORE.VSAM.COBERTURA)
        DISPOSITION(SHARE)
        DSNSHARING(ALLREQS)
        STRINGS(3)
        LSRPOOLID(1)
        READINTEG(UNCOMMITTED)
        DATABUFFERS(2)
        INDEXBUFFERS(1)
        TYPE(VSAM)
        RLSACCESS(NO)
        KEYLENGTH(21)
        RECORDSIZE(150)
        ADD(NO)
        BROWSE(YES)
        DELETE(NO)
        READ(YES)
        UPDATE(NO)
        STATUS(ENABLED)
        OPENTIME(FIRSTREF)
        TABLE(NO)
        MAXNUMRECS(NOLIMIT)
        LOAD(NO)
        UPDATEMODEL(LOCKING)
*
*--------------------------------------------------------------------*
 INSTALL GROUP(LIFECORE)
*--------------------------------------------------------------------*
